# Завдання 2

# Напишіть Python-скрипт, який завантажує текст із заданої URL-адреси, аналізує частоту 
# використання слів у тексті за допомогою парадигми MapReduce і візуалізує топ-слова 
# з найвищою частотою використання у тексті.

# Покрокова інструкція

# Імпортуйте необхідні модулі (matplotlib та інші).
# Візьміть код реалізації MapReduce з конспекту.
# Створіть функцію visualize_top_words для візуалізації результатів.
# У головному блоці коду отримайте текст за URL, застосуйте MapReduce та візуалізуйте результати.

import matplotlib

def visualize_top_words(result):
    pass